{
  "section1": {
    "Name": "Bill Hsu",
    "JobTitle": "Software Engineer",
    "Item1":"Over five years of experience in full-stack website development:",
    "ItemDetail1":"Experienced in database planning, front-end and back-end architecture, and system operation flow.",
    "Item2":"Excellent communication skills:",
    "ItemDetail2":"Skilled in integrating client requirements and proposing solutions through effective communication.",
    "Item3":"Proficient in project management and agile development:",
    "ItemDetail3":"Familiar with Scrum methodologies and proficient in using Teamwork for project management and progress tracking.",
    "Item4":"Proactive and self-directed learner:",
    "ItemDetail4":"Actively explores new industry knowledge, embraces new technologies, and assesses their feasibility for current projects.",
    
    "About_1": "I am a software engineer with around 5 years of experience in both frontend and backend development, and capable of independently completing projects from both ends. My primary experience lies in developing IoT data integration systems, and I excel in information gathering and integration, as well as visualizing data according to client needs.",
    "About_2": "On the frontend, I mainly use Vue.js with UI frameworks to build websites, and on the backend, I primarily use C# to develop APIs or services in the .NET ecosystem. Additionally, I am also familiar with Redis and Websockets."
  },
  "section2": {
    "Title": "Experience",
    "JobTitle": "Software Engineer",
    "EndTime": "Present",
    "Company": "Grade Upon Technology Corp.",
    "Subtitle_1": "System Design",
    "Subtitle_2": "Frontend Development",
    "Subtitle_3": "Backend Development",
    "Content_1": "Plan system architecture, including frontend and backend data integration, and database backup.",
    "Content_2": "Collaborate with UI/UX designers to discuss system operation processes and how to improve user experience.",
    "Content_3": "Write System Test Report and SOP operation documents.",
    "Content_4": "Develop responsive web pages using Vue framework with Bootstrap to present user interfaces such as Dashboard and Runtime Monitor that meet customer needs.",
    "Content_5": "Use i18n to support multiple languages on the website.",
    "Content_6": "Use ECharts package to visualize data and present clear and understandable charts to display data status.",
    "Content_7": "Use MSSQL Server to create a database and store data.",
    "Content_8": "Use Entity Framework to integrate the database, perform data processing, and provide API interfaces.",
    "Content_9": "Use Redis to integrate and apply Sensor data from IoT devices and store it in the database."
  },
  "section3": {
    "Title": "Skills",
    "Subtitle_1": "Frontend",
    "Subtitle_2": "Backend",
    "Content_1": "Language",
    "Content_2": "Library",
    "Content_3": "Build Tool",
    "Content_4": "UI Framework",
    "Content_5": "Linter",
    "Content_6": "Language",
    "Content_7": "Framework",
    "Content_8": "Database",
    "Content_9": "Application",
    "Content_10": "Other Technologies"
  },
  "section4": {
    "Title": "Education",
    "Subtitle_1": "National Taichung University of Education",
    "Subtitle_2": "Department fo Digital Content and Technology"
  }
}