{
  "section1": {
    "Name": "Bill Hsu",
    "JobTitle": "Software Engineer",
    "Item1": "Over five years of experience in full-stack website development",
    "ItemDetail1": "Practical experience in database planning, front-end and back-end architecture, and system operation flow.",
    "Item2": "Excellent communication skills",
    "ItemDetail2": "Skilled in integrating client requirements and proposing solutions through effective communication.",
    "Item3": "Proficient in project management and agile development",
    "ItemDetail3": "Familiar with Scrum methodologies and proficient in using Teamwork for project management and progress tracking.",
    "Item4": "Proactive and self-directed learner",
    "ItemDetail4": "Actively explores new industry knowledge, embraces new technologies, and assesses their feasibility for current projects.",
    "About_1": "I am a software engineer with around 5 years of experience in both frontend and backend development, and capable of independently completing projects from both ends. My primary experience lies in developing IoT data integration systems, and I excel in information gathering and integration, as well as visualizing data according to client needs.",
    "About_2": "On the frontend, I mainly use Vue.js with UI frameworks to build websites, and on the backend, I primarily use C# to develop APIs or services in the .NET ecosystem. Additionally, I am also familiar with Redis and Websockets."
  },
  "section2": {
    "Title": "Experience",
    "JobTitle": "Software Engineer",
    "EndTime": "Present",
    "Company": "Grade Upon Technology Corp.",
    "Subtitle_1": "System Design",
    "Subtitle_2": "Frontend Development",
    "Subtitle_3": "Backend Development",
    "Content_1": "Designed system architecture, encompassing frontend and backend data integration, as well as implementing redundant storage for the database.",
    "Content_2": "Collaborated with UI/UX designers to discuss system operation processes and enhance user experience.",
    "Content_3": "Authored System Test Report and SOP operation documents.",
    "Content_4": "Developed responsive web pages using the Vue framework with Bootstrap to create user interfaces such as Dashboard and Runtime Monitor that align with customer requirements.",
    "Content_5": "Implemented i18n to support multiple languages on the website.",
    "Content_6": "Utilized the ECharts package to visualize data, presenting clear and comprehensible charts that display data status.",
    "Content_7": "Use MSSQL Server to create a database and store data.",
    "Content_8": "Integrated the database using Entity Framework to consolidate data operations and provide API interfaces.",
    "Content_9": "Utilized Redis to connect to IoT devices, retrieve sensor data, and store it in the database for comprehensive processing and utilization."
  },
  "section3": {
    "Title": "Skills",
    "Subtitle_1": "Frontend",
    "Subtitle_2": "Backend",
    "Content_1": "Language",
    "Content_2": "Library",
    "Content_3": "Build Tool",
    "Content_4": "UI Framework",
    "Content_5": "Linter",
    "Content_6": "Language",
    "Content_7": "Framework",
    "Content_8": "Database",
    "Content_9": "Application",
    "Content_10": "Other Technologies"
  },
  "section4": {
    "Title": "Education",
    "Subtitle_1": "National Taichung University of Education",
    "Subtitle_2": "Department fo Digital Content and Technology"
  },
  "section5": {
    "Title": "Project",
    "Technologies": "Technologies:",
    "ProjectContent": "ProjectContent:",
    "Remark": "Project content mainly consists of confidential information. Only important details are extracted.",
    "GServer_Title": "GServer - Data Integration System",
    "GServer_Content_1": "Monitoring the operational status of all equipment on the premises, recording and analyzing alarm events to help clients improve system stability and reliability.",
    "GServer_Content_2": "Integrate sensor data and provide easily comprehensible visual charts to enable customers to analyze and reference the data more effortlessly.",
    "GServer_Content_3": "Provide product control interface to effectively save time and enhance work efficiency, enabling customers to accomplish tasks more quickly.",
    "GServer_Content_4": "Offer an access control framework to assist customers in managing user permissions effectively, ensuring data security and compliance with internal company regulations and laws.",
    "GServer_ImageTitle_2": "Home - Dashboard",
    "GServer_ImageTitle_3": "Visualization of Integrated IoT Data",
    "GServer_ImageTitle_4": "RPA Equipment Monitoring and Bulk Operations",
    "GServer_ImageTitle_5": "RPA Operation Information Statistics",
    "GServer_ImageTitle_6": "Device Login Usage Statistics",
    "GServer_ImageTitle_7": "Device Login Usage Chart",
    "GServer_ImageTitle_8": "Task Scheduling Function",
    "GServer_ImageTitle_9": "User Management and Permission Control",
    "Gumi_Title": "Gumi - Notifications System",
    "Gumi_Content_1": "Provide interface integration for product messages and send notifications based on user settings.",
    "Gumi_Content_2": "Offer a user interface to define the priority, frequency, and number of notifications for events.",
    "Gumi_Content_3": "Integrate user and product data, providing an interface to establish associations between user groups and machine groups.",
    "Gumi_ImageTitle_2": "Home - Dashboard",
    "Gumi_ImageTitle_3": "User Groups",
    "Gumi_ImageTitle_4": "User List",
    "Gumi_ImageTitle_5": "Device Groups",
    "Gumi_ImageTitle_6": "Device List",
    "Gumi_ImageTitle_7": "Notification Settings and Management"
  }
}